# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Lista
labels =['a','b','c']
my_data =[10,20,30]

#Array
v = np.array(my_data)

#Dicionario
d = {
    'a':10,
    'b':20,
    'c':30
}

### Parte 1 - Series

In [3]:
#Visualizar
pd.Series(data =my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [5]:
d

{'a': 10, 'b': 20, 'c': 30}

In [6]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [7]:
#padrao-> pd.Series(data, index)
ser1 = pd.Series([1,2,3],["Taubaté","Londres","Dublin"])
ser1

Taubaté    1
Londres    2
Dublin     3
dtype: int64

In [8]:
ser2 = pd.Series(["Taubaté","Londres","Dublin"])
ser2

0    Taubaté
1    Londres
2     Dublin
dtype: object

In [9]:
ser3 = pd.Series(index = [1,2,3],data =["Taubaté","Londres","Dublin"])
ser3

1    Taubaté
2    Londres
3     Dublin
dtype: object

In [10]:
a = pd.Series(index = ["Taubaté","Londres","Dublin"], data = [10,20,30])
b = pd.Series(index = ["Taubaté", "Londres", "Italia"], data = [10,20,40])

a+b

#Somar as tabelas com mesmo índices

Dublin      NaN
Italia      NaN
Londres    40.0
Taubaté    20.0
dtype: float64

### Parte 2 - DataFrame

In [11]:
from numpy.random import randn

In [12]:
randn(2,3)

array([[-1.6307278 , -1.28190168,  0.01177058],
       [ 0.29813271,  2.2446354 , -0.45073609]])

In [13]:
randn(2,3)

array([[-0.52213412,  0.72129957, -2.8992272 ],
       [-1.52822818, -0.72395819,  0.45174633]])

In [14]:
df = pd.DataFrame(
    data = randn(2,3),
    index= ['A','B'],
    columns= ['x','y','z']
)
df

          x         y         z
A -1.111210  1.022312 -0.557632
B -0.702574  0.794082 -0.313381

In [15]:
df['x']

A   -1.111210
B   -0.702574
Name: x, dtype: float64

In [16]:
df['y']

A    1.022312
B    0.794082
Name: y, dtype: float64

In [17]:
df.y #Mesma coisa

A    1.022312
B    0.794082
Name: y, dtype: float64

In [18]:
df[['x','y']]

          x         y
A -1.111210  1.022312
B -0.702574  0.794082

In [19]:
#New coluna
df['new'] = df['x'] + 100*df['y']
df

          x         y         z         new
A -1.111210  1.022312 -0.557632  101.119975
B -0.702574  0.794082 -0.313381   78.705666

In [20]:
df['new2'] = 100
df

          x         y         z         new  new2
A -1.111210  1.022312 -0.557632  101.119975   100
B -0.702574  0.794082 -0.313381   78.705666   100

In [21]:
#Remover Coluna
df.drop('new',axis = 1,inplace = True)
df.drop('new2',axis = 1,inplace = True)

In [22]:
df

          x         y         z
A -1.111210  1.022312 -0.557632
B -0.702574  0.794082 -0.313381

In [23]:
df.drop('B',axis = 0, inplace = True)

In [24]:
df

         x         y         z
A -1.11121  1.022312 -0.557632

In [25]:
df['x']

A   -1.11121
Name: x, dtype: float64

In [26]:
df[['x','z']]

         x         z
A -1.11121 -0.557632

In [27]:
df

         x         y         z
A -1.11121  1.022312 -0.557632

In [28]:
df.loc[['A'],['x','y']]

         x         y
A -1.11121  1.022312

#### Deletando NaN

In [134]:
dados = {
    'a':[10,2,20,4,5,None,None,10],
    'b':[1,2,30,4,5,6,0,8],
    'c':[1,2,3,15,5,6,7,8]
}

x = pd.DataFrame(dados)
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
a    6 non-null float64
b    8 non-null int64
c    8 non-null int64
dtypes: float64(1), int64(2)
memory usage: 272.0 bytes

In [30]:
### REMOVENDO NaN ... resetar index.... deletar coluna index
y = x.dropna().reset_index().drop('index',axis=1)
y

      a   b   c
0  10.0   1   1
1   2.0   2   2
2  20.0  30   3
3   4.0   4  15
4   5.0   5   5
5  10.0   8   8

#### condição - add valores - Analisando todas colunas

In [31]:
k = y[y > 5]
k

      a     b     c
0  10.0   NaN   NaN
1   NaN   NaN   NaN
2  20.0  30.0   NaN
3   NaN   NaN  15.0
4   NaN   NaN   NaN
5  10.0   8.0   8.0

In [32]:
k = k.dropna()
k

      a    b    c
5  10.0  8.0  8.0

#### condição - add valores - Selecionar colunas

In [33]:
g = y[y['a'] >5]
g

      a   b  c
0  10.0   1  1
2  20.0  30  3
5  10.0   8  8

In [34]:
h = y[y[['a','b']] > 5]
h

      a     b   c
0  10.0   NaN NaN
1   NaN   NaN NaN
2  20.0  30.0 NaN
3   NaN   NaN NaN
4   NaN   NaN NaN
5  10.0   8.0 NaN

#### Deletar uma linha qualquer

In [35]:
x.drop(2,axis=0)

      a  b   c
0  10.0  1   1
1   2.0  2   2
3   4.0  4  15
4   5.0  5   5
5   NaN  6   6
6   NaN  0   7
7  10.0  8   8

In [36]:
x.drop(7,axis=0)

      a   b   c
0  10.0   1   1
1   2.0   2   2
2  20.0  30   3
3   4.0   4  15
4   5.0   5   5
5   NaN   6   6
6   NaN   0   7

### Ordem Crescente e Decrescente

In [114]:
#Crescente
y = x.sort_values('a',ascending = True)
y

      a   b   c
1   2.0   2   2
3   4.0   4  15
4   5.0   5   5
0  10.0   1   1
7  10.0   8   8
2  20.0  30   3
5   NaN   6   6
6   NaN   0   7

In [116]:
# Resetar os ìndices
y = y.reset_index().drop('index',axis=1)
y

      a   b   c
0   2.0   2   2
1   4.0   4  15
2   5.0   5   5
3  10.0   1   1
4  10.0   8   8
5  20.0  30   3
6   NaN   6   6
7   NaN   0   7

In [39]:
#Decrescente
y = x.sort_values('a',ascending= False)
y

      a   b   c
2  20.0  30   3
0  10.0   1   1
7  10.0   8   8
4   5.0   5   5
3   4.0   4  15
1   2.0   2   2
5   NaN   6   6
6   NaN   0   7

### Parte 3 - Missing Data

In [40]:
import numpy as np
import pandas as pd

In [41]:
d = {'A':[1,2,None],'B':[5,np.nan,np.nan],'C':[1,2,3]}

df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
#Retira as colunas que não tem valor
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [43]:
#Retira as linhas sem valor
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [44]:
df.dropna(thresh = 2) 
# Retira a tabela que tenha 2 ou mais None

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [45]:
df.fillna(value = "Sem nada")

          A         B  C
0         1         5  1
1         2  Sem nada  2
2  Sem nada  Sem nada  3

In [46]:
df["A"].fillna(value = df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Part 4 - Pandas - Groupby

In [47]:
data = {
    'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person':['Sam','Charlie',"Amy",'Vanessa','Carl','Sarah'],
    'Sales':[200,120,340,124,243,350]
}

In [48]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [49]:
import matplotlib.pyplot as plt
df['Sales'].hist(bins = 20)

In [50]:
byComp = df.groupby('Company')
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [51]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [52]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [53]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [54]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [55]:
byComp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [56]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [57]:
byComp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [58]:
byComp.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [59]:
byComp['Sales'].max()

Company
FB      350
GOOG    200
MSFT    340
Name: Sales, dtype: int64

In [60]:
byComp['Sales'].sum()

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

### Parte 5 - Merging, Joining, and Concatenating

In [61]:
data1 = {
    'A':np.arange(0,4),
    'B':np.arange(4,8),
    'C':np.arange(8,12)
}
index1 = [0,1,2,3]

df1 = pd.DataFrame(data1,index1)
df1

   A  B   C
0  0  4   8
1  1  5   9
2  2  6  10
3  3  7  11

In [62]:
data2 = {
    'A':np.arange(12,16),
    'B':np.arange(16,20),
    'C':np.arange(20,24)
}
index2 = [4,5,6,7]

df2 = pd.DataFrame(data2,index2)
df2

    A   B   C
4  12  16  20
5  13  17  21
6  14  18  22
7  15  19  23

In [63]:
data3 = {
    'A':np.arange(24,28),
    'B':np.arange(28,32),
    'C':np.arange(32,36)
}
index3 = [8,9,10,11]

df3 = pd.DataFrame(data3,index3)
df3

     A   B   C
8   24  28  32
9   25  29  33
10  26  30  34
11  27  31  35

#### Concatenation (Todas Colunas devem ser iguais)

In [64]:
pd.concat([df1,df2,df3])

     A   B   C
0    0   4   8
1    1   5   9
2    2   6  10
3    3   7  11
4   12  16  20
5   13  17  21
6   14  18  22
7   15  19  23
8   24  28  32
9   25  29  33
10  26  30  34
11  27  31  35

In [120]:
pd.concat([df1,df2,df3],axis=1)

    miguel  priscila     D     E     F     A     B     C
0      1.0       5.0  12.0  16.0  20.0   NaN   NaN   NaN
1      2.0       6.0  13.0  17.0  21.0   NaN   NaN   NaN
2      3.0       7.0  14.0  18.0  22.0   NaN   NaN   NaN
3      4.0       8.0  15.0  19.0  23.0   NaN   NaN   NaN
8      NaN       NaN   NaN   NaN   NaN  24.0  28.0  32.0
9      NaN       NaN   NaN   NaN   NaN  25.0  29.0  33.0
10     NaN       NaN   NaN   NaN   NaN  26.0  30.0  34.0
11     NaN       NaN   NaN   NaN   NaN  27.0  31.0  35.0

#### Merging (tem que ter pelo menos uma coluna repetida)

In [66]:
data1 = {
    'A':['A0','A1','A2'],
    'key':['K0','K1','K2']
}


mg1 = pd.DataFrame(data1)
mg1

    A key
0  A0  K0
1  A1  K1
2  A2  K2

In [67]:
data2 = {
    'B':['B0','B1','B2'],
    'key':['K0','K1','K2']
}


mg2 = pd.DataFrame(data2)
mg2

    B key
0  B0  K0
1  B1  K1
2  B2  K2

In [68]:
pd.merge(mg1,mg2)
#Só funciona se tiver uma coluna igual... por isso
#coloquei a 'Key'

    A key   B
0  A0  K0  B0
1  A1  K1  B1
2  A2  K2  B2

In [69]:
pd.merge(right = mg1, left = mg2)

    B key   A
0  B0  K0  A0
1  B1  K1  A1
2  B2  K2  A2

#### Joining ( Não precisa de coluna repetida)

In [70]:
data1 = {
    'A':np.arange(0,4),
    'B':np.arange(4,8),
    'C':np.arange(8,12)
}


df1 = pd.DataFrame(data1)
df1

   A  B   C
0  0  4   8
1  1  5   9
2  2  6  10
3  3  7  11

In [71]:
data2 = {
    'D':np.arange(12,16),
    'E':np.arange(16,20),
    'F':np.arange(20,24)
}


df2 = pd.DataFrame(data2)
df2

    D   E   F
0  12  16  20
1  13  17  21
2  14  18  22
3  15  19  23

In [72]:
df1.join(df2)

   A  B   C   D   E   F
0  0  4   8  12  16  20
1  1  5   9  13  17  21
2  2  6  10  14  18  22
3  3  7  11  15  19  23

### Parte 6 - Operations

In [73]:
data1 = {
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
}

df = pd.DataFrame(data = data1)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [74]:
df['col2'].unique()

array([444, 555, 666])

In [75]:
len(df['col2'].unique())

3

In [76]:
df['col2'].value_counts()#Contador

444    2
555    1
666    1
Name: col2, dtype: int64

In [77]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [78]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [79]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [80]:
def times2(x):
    return x*2

In [81]:
df['col1'].apply(times2) 
# Apply usar quando tem funcao

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [82]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [83]:
df.drop('col1',axis=1) # retirar col 1

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [84]:
df.drop(2,axis=0) # Retirar linhas 2

   col1  col2 col3
0     1   444  abc
1     2   555  def
3     4   444  xyz

In [85]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [86]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [87]:
df.sort_values('col2') 
#Organiza os valores repetidos

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [88]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Parte 7 - Data Input and Output

In [89]:
import pandas as pd

In [90]:
df = pd.read_csv('./dados_panda/dados.csv')
df

     Inf  Miguel  Priscila
0  Gasto     100      1000
1  Ganho    3500      3500
2  Lucro    3400      2500

In [91]:
#Criar
df.to_csv('./dados_panda/My_output',index = False)

In [92]:
pd.read_csv('./dados_panda/My_output')

     Inf  Miguel  Priscila
0  Gasto     100      1000
1  Ganho    3500      3500
2  Lucro    3400      2500

In [93]:
data1 = {
    'miguel':[1,2,3,4],
    'priscila':[5,6,7,8],
}

df1 = pd.DataFrame(data = data1)
df1

   miguel  priscila
0       1         5
1       2         6
2       3         7
3       4         8

In [94]:
#Criei arquivo
df1.to_csv('./dados_panda/teste.txt') # Ok
df1.to_csv('./dados_panda/teste') # Ok
#df1.to_csv('./dados_panda/teste.csv') #BUG...

#### html

dica: Instalar lxml

In [95]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

#### Lista html
No HTML, as listas são dada como < li > ou < tr >

In [96]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
5,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
6,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"
7,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017"
8,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017"
9,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017"
10,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017"
11,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017"
12,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017"
13,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017"
14,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016"
15,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016"
16,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016"
17,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016"
18,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016"
19,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015"
20,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015"
21,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015"
22,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015"
23,Doral Bank En Español,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015"
24,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015"
25,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015"
26,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015"
27,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014"
28,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014"
29,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014"
...,...,...,...,...,...,...
531,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008"
532,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008"
533,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008"
534,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007"
535,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007"
536,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007"
537,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004"
538,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004"
539,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004"
540,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004"
541,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003"
542,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003"
543,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003"
544,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002"
545,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002"
546,AmTrade International Bank En Español,Atlanta,GA,33784,No Acquirer,"September 30, 2002"
547,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002"
548,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002"
549,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002"
550,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002"
551,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002"
552,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002"
553,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002"
554,"Hamilton Bank, NA En Español",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002"
555,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001"
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [97]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [98]:
datax = pd.read_html('https://exame.abril.com.br/seu-dinheiro/os-precos-dos-carros-mais-vendidos-do-brasil-em-2016/')

In [99]:
datax[1]

                                    Versão         Preço
0      HB20 Copa do Mundo 1.0 Flex 12V Mec  R$ 41.883,00
1   HB20 Comf./C.Plus/C.Style 1.0 Flex 12V  R$ 42.448,00
2    HB20 Comfort Plus 1.0 TB Flex 12V Mec  R$ 47.747,00
3     HB20 Copa do Mundo 1.6 Flex 16V Aut.  R$ 48.801,00
4  HB20 C./C.Plus/C.Style 1.6 Flex 16V Mec  R$ 51.112,00
5     HB20 C.Style/C.Plus 1.6 Flex 16V Aut  R$ 55.742,00

### APLICANDO FUNÇÕES COM APPLY()

In [168]:
dados = {
    'a':[10,2,20,4,5,None,None,10],
    'b':[1,2,30,4,5,6,0,8],
    'c':[1,2,3,15,5,6,7,8]
}

df = pd.DataFrame(dados)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
a    6 non-null float64
b    8 non-null int64
c    8 non-null int64
dtypes: float64(1), int64(2)
memory usage: 272.0 bytes

In [169]:
def sem_cond(x):
    return x*100

In [170]:
df.apply(sem_cond)

        a     b     c
0  1000.0   100   100
1   200.0   200   200
2  2000.0  3000   300
3   400.0   400  1500
4   500.0   500   500
5     NaN   600   600
6     NaN     0   700
7  1000.0   800   800

In [171]:
# Ou podemos usar Lambda

df.apply(lambda x: x*100)

        a     b     c
0  1000.0   100   100
1   200.0   200   200
2  2000.0  3000   300
3   400.0   400  1500
4   500.0   500   500
5     NaN   600   600
6     NaN     0   700
7  1000.0   800   800

In [ ]:
# SE COLOCAR CONDIÇÃO ( IF E ELSE) NÃO FUNCIONA NA MATRIZ TODA!!!

#ENTÃO PRECISAMOS COLOCAR APENAS EM UMA COLUNA...

In [173]:
def com_cond(x):
    if x > 7:
        return x*100
    else:
        return 0

In [178]:
df['a'].apply(com_cond)

0    1000.0
1       0.0
2    2000.0
3       0.0
4       0.0
5       0.0
6       0.0
7    1000.0
Name: a, dtype: float64

In [184]:
df['a'].apply(lambda x: x*100 if x > 7 else 0)

0    1000.0
1       0.0
2    2000.0
3       0.0
4       0.0
5       0.0
6       0.0
7    1000.0
Name: a, dtype: float64